app/views/organisers/show.html.erb


<% if @organiser.events.count != 0 %>
---
SELECT "events".* FROM "events"