app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "organiser_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Wed, 11 Dec 2013 20:19:02 UTC +00:00], ["description", "World"], ["organiser_id", 9], ["title", "Nine"], ["updated_at", Wed, 11 Dec 2013 20:19:02 UTC +00:00], ["url", "Geek Fest"]]
---
  def create
    @event = Event.new(event_params)
    @event.organiser = current_organiser
    @event.save!