app/controllers/organisers_controller.rb

  def show
    @events = Event.all
---
SELECT "events".* FROM "events"

  def profile
    @organiser = Organiser.find(params[:id])
---
SELECT "organisers".* FROM "organisers" WHERE "organisers"."id" = 9 ORDER BY "organisers"."id" ASC LIMIT 1