app/controllers/participants_controller.rb

SELECT "events".* FROM "events"
---
  def show
    @participant = current_participant
    # @participant = Participant.find(params[:id])
    @events = Event.all