app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants" WHERE "participants"."id" = 1 ORDER BY "participants"."id" ASC LIMIT 1
---
  def index
    @participant_1 = Participant.find_by_id(params[:id])

SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT 1  [["id", "hvkjgckuckccfchgchfchc"]]
---
  def profile
    @participant = Participant.find(params[:id])

SELECT "participants".* FROM "participants" WHERE "participants"."id" = 2 ORDER BY "participants"."id" ASC LIMIT 1
---
  def edit
    @participant = Participant.find(params[:id])

SELECT "participants".* FROM "participants" WHERE "participants"."id" = 2 ORDER BY "participants"."id" ASC LIMIT 1
UPDATE "participants" SET "name" = $1, "updated_at" = $2 WHERE "participants"."id" = 2  [["name", "Billy"], ["updated_at", Tue, 10 Dec 2013 16:49:24 UTC +00:00]]
---
  def update
    @participant = Participant.find(params[:id])
    @participant.update_attributes(profile_params)